Revit 2027 API
InternalOrigin.Get Method
 Gets the internal origin for the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static InternalOrigin Get(
	Document document
)
Public Shared Function Get (
	document As Document
) As InternalOrigin
public:
static InternalOrigin^ Get(
	Document^ document
)
static member Get :
        document : Document -> InternalOrigin
Parameters
document Document
 Revit document from which to get the internal origin.
Return Value
InternalOrigin
 The internal origin of the document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
InternalOrigin Class
Autodesk.Revit.DB Namespace